// Задача 57: Составить частотный словарь элементов двумерного массива. Частотный словарь содержит информацию о том, сколько раз встречается элемент входных данных.
// пусть будет двумерный массив из случайных чисел от 0 до 9 включительно
// 1, 2, 3 
// 4, 6, 1 
// 2, 1, 6
// 1 встречается 3 раза 
// 2 встречается 2 раз 
// 3 встречается 1 раз 
// 4 встречается 1 раз 
// 6 встречается 2 раза
// Задача 55: Задайте двумерный массив. 
// Напишите программу, которая заменяет строки на столбцы. В случае, если это невозможно, программа должна вывести сообщение для пользователя.
Console.WriteLine("Введите число");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число");
int m = Convert.ToInt32(Console.ReadLine());

int[,] matrix = new int[n, m];
FillArray(matrix);
PrintArray(matrix);
Console.WriteLine();
int[] matrix2 = UniqArray(matrix);
PrintFreqArray(matrix2);




void PrintFreqArray(int[] uniq)
{
    for (int i = 0; i < uniq.Length; i++)
    {
        if (uniq[i]!=0)
            Console.WriteLine($"Число {i} встречается {uniq[i]} раз");
    }
}

int[] UniqArray(int[,] matrix)
{
    int[] uniq = new int[10];
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            uniq[matrix[i,j]]++;
        }
    }
    return uniq;
}

void FillArray(int[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i,j] = new Random().Next(0,10);
        }
    }
}

void PrintArray(int[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            Console.Write($"{matrix[i, j]} ");
        }
        Console.WriteLine();
    }
}
